In [57]:
# import psycopg2

# conn = psycopg2.connect(
#                         database="postgres",
#                         host="localhost",
#                         user="postgres",
#                         password="12345",
#                         port="5432")

# cursor = conn.cursor()

In [58]:
# cursor.execute("SELECT * FROM u_data")
# rows=cursor .fetchall()
# cols=[dese[0] for  dese in cursor.description]

In [67]:
# import pandas as pd

# df=pd.DataFrame(data=rows,columns=cols)
# df

   bhk  area    sale       furnus  f1  f2
0    1   242  Resale  Unfurnished   1   3
1    1   242  Resale  Unfurnished   1   3

In [68]:
def flow(bhk,area,sale,furnus,f1,f2):

    bhk=int(bhk)
    area=int(area)
    sale=str(sale)
    furnus=str(furnus)
    f1=int(f1)
    f2=int(f2)
    #insert query 
    cursor.execute(f"INSERT INTO newtable VALUES ({bhk}, {area}, {sale} ,{furnus}, {f1}, {f2})")
    # cursor.execute("SELECT * FROM u_data")
    #fetch data
    #covert bhk,area into integer
    #covert sale into 0,1 form 
    #conert furnus into 0,1,2
    #convert f1,f1 into integer

In [69]:
flow(2,231,"Resale","Unfurnished",2,4)

InFailedSqlTransaction: current transaction is aborted, commands ignored until end of transaction block

In [92]:
import psycopg2

connection = psycopg2.connect(
                        database="postgres",
                        host="localhost",
                        user="postgres",
                        password="12345",
                        port="5432"
        )

cursor = connection.cursor()

def add_to_newtable(bhk, area, sale, furnus, f1, f2):
        if sale=="Resale":
            sale=int(1)
        else:
            sale=int(0)

        if furnus=="Furnished":
            furnus=int(2)
        elif furnus=="Semi-Furnished":
            furnus=int(1)
        else:
            furnus=int(0)
        
        insert_query = """
        INSERT INTO newtable (bhk, area, sale, furnus, f1, f2)
        VALUES (%s, %s, %s, %s, %s, %s);
        """
        cursor.execute(insert_query, (bhk, area, sale, furnus, f1, f2))
        print("Values added to newtable successfully.")
       

# Example usage:
add_to_newtable(3, 890, "Resale", "Furnished", 0,5)

Values added to newtable successfully.

In [93]:
 select_query = "SELECT * FROM newtable"
cursor.execute(select_query)
records = cursor.fetchall()
print(records)

[(3, 890, 1, 2, 0, 5)]